snlkuharlocal/src/DataProcessors/ЗаполнениеЗаказовФБСМаркиовкой/ЗаполнениеЗаказовФБСМаркиовкой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеЗаказовФБСМаркиовкой</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЗаказыFBSМаркировка/ЗаказыFBSМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаказыFBSМаркировка</name>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказFBS</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ЗаполнениеЗаказовФБСМаркиовкой/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров=НЕОПРЕДЕЛЕНО) Экспорт   	
	
	ЗаполнимРегистрНовымиЗаказами();
	
	Если ТаблицаПараметров=Неопределено Тогда 
		
		Маркетплейс =Справочники.ИнетМагазины.НайтиПоКоду("00009");
		
		КодМаркетплейса ="00009";
		ПрикрепимМаркуВайлдбериз(Маркетплейс);

	Иначе	
		
		ПараметрыОтбора  = Новый Структура;
		ПараметрыОтбора.Вставить("Имя","МаркетПлейс");
		НайденныеМаркеты = ТаблицаПараметров.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого текМаркет из НайденныеМаркеты Цикл
			
			КодМаркетплейса = текМаркет.Значение; 
			
			Маркетплейс =Справочники.ИнетМагазины.НайтиПоКоду(КодМаркетплейса);
			
			Если Маркетплейс=Справочники.ИнетМагазины.ПустаяСсылка() Тогда
				Возврат;
			КонецЕсли;  
			
			Если КодМаркетплейса ="00001" или КодМаркетплейса ="00009" Тогда
				//Вайлдбериз
				ПрикрепимМаркуВайлдбериз(Маркетплейс);
				
			// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
			ИначеЕсли КодМаркетплейса = "00004" Тогда
				// Яндекс.Маркет
				МП_ЯндексМаркет_ОтправитьМаркировку(Маркетплейс);
			// Ихсанов Д. А. Конец 28.01.2025
				
			ИначеЕсли  КодМаркетплейса ="00002" Тогда	 
				//Озон
				//25.07.24
				//Тимофеев Ю.А. пока отлкючим добавление марки в фоне
				//для ОЗОН так не работает				
				//ПрикрепимМаркуОзон(Маркетплейс); 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрикрепимМаркуОзон(Маркетплейс)	
	//это методы ОЗОН   		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыFBSМаркировка.ЗаказFBS КАК ЗаказFBS,
	|	ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование КАК РНК
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|ГДЕ
	|	ЗаказыFBSМаркировка.Обработан = ЛОЖЬ
	|	И ЗаказыFBSМаркировка.ЗаказFBS.Дата > &Дата
	|	И ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование.ТребуетсяМаркировка
	|	И ЗаказыFBSМаркировка.ЗаказFBS.Контрагент = &Контрагент";
	//Параметры запроса
	Запрос.УстановитьПараметр("Дата",ТекущаяДата()- 5*86400);// смотрим все заказы НЕ ОБРАБОТАННЫЕ за крайние 5 дня
	Запрос.УстановитьПараметр("Контрагент",Маркетплейс.Контрагент);// Контрагенты
	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	
	СписокСостояний = Новый Массив;
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.ОжиданиеПаллетирования);
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.Паллетирование);
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НужнаяРНК = Выборка.РНК;
		
		Если СписокСостояний.Найти(НужнаяРНК.СостояниеНакладной)<>Неопределено Тогда
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		
		Сообщение= "Добавление марки в фоновом задании для "+Строка(НужнаяРНК);
		ЗаписатьВЛог("МП_ОЗОН",Сообщение,"Информация");

		
		
		Запрос2 = Новый Запрос;
		Запрос2.Текст = "ВЫБРАТЬ
		                |	ЛистНабора.Ссылка КАК Ссылка
		                |ПОМЕСТИТЬ ЛИСТОЧКИ
		                |ИЗ
		                |	Документ.ЛистНабора КАК ЛистНабора
		                |ГДЕ
		                |	ЛистНабора.ДокОснование = &РНК
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа,
		                |	ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		                |	ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора КАК ШтрихкодНабора
		                |ИЗ
		                |	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
		                |ГДЕ
		                |	ЛистНабораШтрихкодыУпаковок.Ссылка В
		                |			(ВЫБРАТЬ
		                |				ЛИСТОЧКИ.Ссылка КАК Ссылка
		                |			ИЗ
		                |				ЛИСТОЧКИ КАК ЛИСТОЧКИ)";
		//Параметры запроса
		Запрос2.УстановитьПараметр("РНК",НужнаяРНК);// РНК
		Результат2 = Запрос2.Выполнить();
		
		Если Результат2.Пустой() Тогда
			Продолжить;
		КонецЕсли;
				
		Выборка2 = Результат2.Выбрать();
		
		Пока Выборка2.Следующий() Цикл
			
			//НомерОтправления -   
			
			
			НовТЗМарки = ОбменМаркетПлейс.МП_ОЗОН_ПолучитьЭкземлярыДляМаркировки(Маркетплейс,Выборка2.НомерЗаказа);
			
			//добавим марку к заказу
			
			 //Тимофеев Ю.А. Начало   04-02-2025
			 //
			 //
			ДатаМатрикс = Выборка2.ШтрихкодУпаковки; 
			Если ЗначениеЗаполнено(Выборка2.ШтрихкодНабора) Тогда 					
				ДатаМатрикс = Выборка2.ШтрихкодНабора;			   					
			КонецЕсли;

			 
			 //Тимофеев Ю.А. Конец    04-02-2025
			
			Если ОбменМаркетПлейс.МП_ОЗОН_привязать_Маркировку(Маркетплейс,Выборка2.НомерЗаказа,НовТЗМарки,ДатаМатрикс) Тогда
				
				//проверим статус если есть возможность перевода, переводим	
				Если  ОбменМаркетПлейс.МП_ОЗОН_ПроверкаСтатусаЗаказаСМаркировкой(МаркетПлейс,Выборка2.НомерЗаказа) Тогда
											
					//переводим заказ и скачиваем этикетку					
					ОбменМаркетПлейс.МП_ОЗОН_переводЗаказаВДругойСтатус(Маркетплейс,Выборка2.НомерЗаказа,НовТЗМарки,Истина);
					
					ТекЗаказFBS = Выборка.ЗаказFBS;
					
					РегЗаказМарка = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьМенеджерЗаписи();
					РегЗаказМарка.ЗаказFBS = ТекЗаказFBS;
					РегЗаказМарка.Прочитать();
					
					Если РегЗаказМарка.Выбран() Тогда
						
						РегЗаказМарка.Обработан=Истина;
						РегЗаказМарка.Записать();
						
					КонецЕсли;  						
					
				КонецЕсли;
				
			КонецЕсли;      					
			
		КонецЦикла; 						
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрикрепимМаркуВайлдбериз(Маркетплейс)	Экспорт
	
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000240 от 06.07.2026 10:31:10: e1cib/data/Документ.Изменение?ref=896d0050568f680711f1790ca80af2c3
	// Изменение состояний накладных при отправке данных в РВБ
	// У накладных уже должны быть готовые ОМ (Формирование набора)
	СписокСостояний = Новый Массив;
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
	СписокСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
	// Ихсанов Д. А. Конец  07.07.2026
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыFBSМаркировка.ЗаказFBS КАК ЗаказFBS,
	|	ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование КАК РНК
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|ГДЕ
	|	ЗаказыFBSМаркировка.Обработан = ЛОЖЬ
	|	И ЗаказыFBSМаркировка.ЗаказFBS.Дата > &Дата
	|	И ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование.ТребуетсяМаркировка
	|	И ЗаказыFBSМаркировка.ЗаказFBS.Контрагент = &Контрагент
	|	И ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование.Договор = &Договор
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000240 от 06.07.2026 10:31:10: e1cib/data/Документ.Изменение?ref=896d0050568f680711f1790ca80af2c3
	|	И ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование.СостояниеНакладной В (&СостоянияНакладной)";
	// Ихсанов Д. А. Конец  07.07.2026
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - Маркетплейс.ПериодСут * 86400);
	Запрос.УстановитьПараметр("Контрагент",Маркетплейс.Контрагент);
	Запрос.УстановитьПараметр("Договор", Маркетплейс.Договор);
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000240 от 06.07.2026 10:31:10: e1cib/data/Документ.Изменение?ref=896d0050568f680711f1790ca80af2c3
	Запрос.УстановитьПараметр("СостоянияНакладной", СписокСостояний);
	// Ихсанов Д. А. Конец  07.07.2026
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НужнаяРНК = Выборка.РНК;
		
		Если СписокСостояний.Найти(НужнаяРНК.СостояниеНакладной)<>Неопределено Тогда
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		
		Запрос2 = Новый Запрос;
		// Ихсанов Д. А. Начало 03.07.2026 Изменение 0000000239 от 03.07.2026 16:54:45: e1cib/data/Документ.Изменение?ref=896d0050568f680711f176e6bbb78b04
		// Доработка на выдачу кода с криптохвостом
		Запрос2.Текст = "ВЫБРАТЬ
		|	ЛистПереукладки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЛИСТОЧКИ
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|ГДЕ
		|	ЛистПереукладки.ДокОснование = &РНК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	Документ.ЛистПереукладки.ШтрихкодыУпаковок КАК ЛистПереукладкиШтрихкодыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО ЛистПереукладкиШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		|ГДЕ
		|	ЛистПереукладкиШтрихкодыУпаковок.Ссылка В
		|			(ВЫБРАТЬ
		|				ЛИСТОЧКИ.Ссылка КАК Ссылка
		|			ИЗ
		|				ЛИСТОЧКИ КАК ЛИСТОЧКИ)
		|	И ЛистПереукладкиШтрихкодыУпаковок.НомерЗаказа <> """"";
		// Ихсанов Д. А. Конец  03.07.2026
		//Параметры запроса
		Запрос2.УстановитьПараметр("РНК",НужнаяРНК);// РНК
		Результат2 = Запрос2.Выполнить();
		
		Если Результат2.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		
		ПрикреплениеМарки = Ложь;
		
		Выборка2 = Результат2.Выбрать();
		
		Пока Выборка2.Следующий() Цикл
			
			//26.06.2024 Тимофеев Ю.А. проверим статус заказа - должен быть CONFIRM
			СтатусВСборке=ОбменМаркетПлейс.МП_Вайлдберриз_ВернутьСтатусЗаказа(Маркетплейс,Выборка2.НомерЗаказа);
			
			Если СтатусВСборке Тогда  
				// Ихсанов Д. А. Начало 03.07.2026 Изменение 0000000239 от 03.07.2026 16:54:45: e1cib/data/Документ.Изменение?ref=896d0050568f680711f176e6bbb78b04
				КодМаркировки = "";
				Если ЗначениеЗаполнено(Выборка2.ЗначениеШтрихкода) Тогда
					КодМаркировки = Справочники.ШтрихкодыУпаковокТоваров.ВосстановитьКод_GS1(Выборка2.ЗначениеШтрихкода);
				КонецЕсли;
				
				ПрикреплениеМарки = ОбменМаркетПлейс.МП_Вайлдберриз_ЗаписатьМаркуНаЗаказ(Маркетплейс,
					Выборка2.НомерЗаказа, КодМаркировки);
				// Ихсанов Д. А. Конец  03.07.2026
			КонецЕсли;
			
		КонецЦикла;   		
		
		Если ПрикреплениеМарки Тогда
			
			ТекЗаказFBS = Выборка.ЗаказFBS;
			
			//в любом случае ставим флаг , что заказ ФБС обработан
			РегЗаказМарка = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьМенеджерЗаписи();
			РегЗаказМарка.ЗаказFBS = ТекЗаказFBS;
			РегЗаказМарка.Прочитать();
			
			Если РегЗаказМарка.Выбран() Тогда
				РегЗаказМарка.Обработан=Истина;
				РегЗаказМарка.Записать();
			КонецЕсли; 
			
		КонецЕсли;
		//////////////////////////////////////////////////////
		
	КонецЦикла;     	
	
КонецПроцедуры

Процедура ЗаполнимРегистрНовымиЗаказами() Экспорт
	
	
	//возьмем дату крайнего документа из регистра
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыFBSМаркировка.ЗаказFBS.Дата КАК ТекДата
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекДата УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ТекДата = Результат.текДата;
	Иначе
		ТекДата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	//если текдата вчерашняя то проверим еще раз вчерашний день с самого утра
	Если ТекДата<НачалоДня(ТекущаяДата()) Тогда
		ТекДата=НачалоДня(НачалоДня(ТекущаяДата())-10);
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрРНК
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Дата >= &Дата
	|	И РасходнаяНакладная.ТребуетсяМаркировка
	|	И РасходнаяНакладная.ДистанционнаяПродажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаFBS.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрЗаказы
	|ИЗ
	|	Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|ГДЕ
	|	ЗаказКлиентаFBS.ДокОснование В
	|			(ВЫБРАТЬ
	|				ВрРНК.Ссылка КАК Ссылка
	|			ИЗ
	|				ВрРНК КАК ВрРНК)
	|	И ЗаказКлиентаFBS.Дата >= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыFBSМаркировка.ЗаказFBS КАК ЗаказFBS
	|ПОМЕСТИТЬ ВрРегистр
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|ГДЕ
	|	ЗаказыFBSМаркировка.ЗаказFBS.Дата МЕЖДУ &НачДата И &КонДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрЗаказы.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВрРегистр.ЗаказFBS.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Проверка
	|ПОМЕСТИТЬ ВрИтог
	|ИЗ
	|	ВрЗаказы КАК ВрЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрРегистр КАК ВрРегистр
	|		ПО ВрЗаказы.Ссылка = ВрРегистр.ЗаказFBS
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрИтог.Ссылка КАК Заказ
	|ИЗ
	|	ВрИтог КАК ВрИтог
	|ГДЕ
	|	ВрИтог.Проверка";
	//Параметры запроса
	
	Запрос.УстановитьПараметр("Дата",  ТекДата);// Дата   	
	Запрос.УстановитьПараметр("НачДата",НачалоДня(ТекДата));// Дата
	Запрос.УстановитьПараметр("КонДата",ТекущаяДата());// Дата
	
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	//получим список НОВЫХ заказов
	
	Для Каждого текЗаказ из Результат Цикл
		
		МойЗаказ = ТекЗаказ.Заказ;  		
		
		//перед запись дополнительно проверим
		
		Набор = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьНаборЗаписей();
		Набор.Отбор.ЗаказFBS.Установить(МойЗаказ);
		
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			Попытка
				РегЗаказМарка = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьМенеджерЗаписи();
				РегЗаказМарка.ЗаказFBS = МойЗаказ;
				РегЗаказМарка.Записать();   
			исключение
				
			КонецПопытки;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#Область МП_ЯндексМаркет

// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
// Процедура - Яндекс маркет отправить маркировку
//
// Параметры:
//  Маркетплейс	МаркетПлейс	- СправочникСсылка.ИнетМагазины - Ссылка на МаркетПлейс.
//
Процедура МП_ЯндексМаркет_ОтправитьМаркировку(Маркетплейс) Экспорт 
	
	Обработки.ЗаполнениеЗаказовФБСМаркиовкой.МП_ЯндексМаркет_ОтправитьМаркировку(Маркетплейс);
	
КонецПроцедуры // ЯндексМаркет_ОтправитьМаркировку()
// Ихсанов Д. А. Конец 28.01.2025

#КонецОбласти

#Область МП_МагнитМаркет

// Ихсанов Д. А. Начало 25.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
// Процедура - Яндекс маркет отправить маркировку
//
// Параметры:
//  Маркетплейс	МаркетПлейс	- СправочникСсылка.ИнетМагазины - Ссылка на МаркетПлейс.
//
Процедура МП_МагнитМаркет_ОтправитьМаркировку(Маркетплейс) Экспорт 
	
	Обработки.ЗаполнениеЗаказовФБСМаркиовкой.МП_МагнитМаркет_ОтправитьМаркировку(Маркетплейс);
	
КонецПроцедуры // ЯндексМаркет_ОтправитьМаркировку()
// Ихсанов Д. А. Конец 25.03.2025

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
